Repository: THLong0907/GridMaster
Catalog: lib/l10n/app_*.arb
Languages: ar, bn, fa, fil, he, hi, ms, sw, th, vi

# appTitle
source: Grid Master
ar: غريد ماستر
bn: গ্রিড মাস্টার
fa: گرید مستر
he: גריד מאסטר
hi: ग्रिड मास्टर
th: กริดมาสเตอร์
vi: Vua Xếp Gạch

source: SCORE
ar: النقاط
bn: স্কোর
fa: امتیاز
fil: PUNTOS
he: ניקוד
hi: स्कोर
ms: SKOR
sw: POINTI
th: คะแนน
vi: ĐIỂM

source: HIGH SCORE
ar: أعلى نتيجة
bn: সর্বোচ্চ স্কোর
fa: بالاترین امتیاز
fil: PINAKAMATAAS
he: שיא
hi: उच्चतम स्कोर
ms: SKOR TERTINGGI
sw: KUMBUKUMBU BORA
th: คะแนนสูงสุด
vi: KỶ LỤC

source: GAME OVER
ar: انتهت اللعبة
bn: গেম ওভার
fa: پایان بازی
fil: TAPOS NA
he: המשחק נגמר
hi: गेम ओवर
ms: PERMAINAN TAMAT
sw: MCHEZO UMEISHA
th: จบเกม
vi: KẾT THÚC

source: NEW HIGH SCORE!
ar: رقم قياسي جديد!
bn: নতুন রেকর্ড!
fa: رکورد جدید!
fil: BAGONG RECORD!
he: שיא חדש!
hi: नया रिकॉर्ड!
ms: REKOD BARU!
sw: REKODI MPYA!
th: สถิติใหม่!
vi: KỶ LỤC MỚI!

source: PLAY AGAIN
ar: العب مرة أخرى
bn: আবার খেলুন
fa: دوباره بازی
fil: ULITIN
he: שחק שוב
hi: फिर से खेलें
ms: MAIN LAGI
sw: CHEZA TENA
th: เล่นอีกครั้ง
vi: CHƠI LẠI

source: HOME
ar: الرئيسية
bn: হোম
fa: خانه
he: בית
hi: होम
ms: UTAMA
sw: NYUMBANI
th: หน้าหลัก
vi: TRANG CHỦ

source: SHARE
ar: مشاركة
bn: শেয়ার
fa: اشتراک
fil: IBAHAGI
he: שתף
hi: शेयर
ms: KONGSI
sw: SHIRIKI
th: แชร์
vi: CHIA SẺ

source: RESTART
vi: CHƠI LẠI

source: Settings
ar: الإعدادات
bn: সেটিংস
fa: تنظیمات
fil: Mga Setting
he: הגדרות
hi: सेटिंग्स
ms: Tetapan
sw: Mipangilio
th: ตั้งค่า
vi: Cài đặt

source: Sound
ar: الصوت
bn: শব্দ
fa: صدا
fil: Tunog
he: צליל
hi: ध्वनि
ms: Bunyi
sw: Sauti
th: เสียง
vi: Âm thanh

source: Haptics
ar: الاهتزاز
bn: কম্পন
fa: لرزش
fil: Vibration
he: רטט
hi: कंपन
ms: Getaran
sw: Mtetemo
th: สั่น
vi: Rung

source: Reset Progress
ar: إعادة التعيين
bn: রিসেট
fa: بازنشانی پیشرفت
fil: I-reset ang Progress
he: איפוס התקדמות
hi: प्रगति रीसेट करें
ms: Set semula kemajuan
sw: Weka upya maendeleo
th: รีเซ็ตความคืบหน้า
vi: Xóa dữ liệu

# resetConfirmTitle
source: Reset Progress?
ar: إعادة التعيين؟
bn: রিসেট করবেন?
fa: بازنشانی؟
fil: I-reset?
he: לאפס?
hi: रीसेट करें?
ms: Set semula?
sw: Weka upya?
th: รีเซ็ต?
vi: Xóa dữ liệu chơi?

# resetConfirmContent
source: This will delete your high scores and unlocked themes. This cannot be undone.
ar: سيتم حذف جميع النتائج والسمات. لا يمكن التراجع.
bn: সব স্কোর ও থিম মুছে যাবে। পূর্বাবস্থায় ফেরানো যাবে না।
fa: تمام نتایج و تم‌ها حذف خواهند شد. قابل بازگشت نیست.
fil: Mabubura ang high scores at mga na-unlock na tema. Hindi na ito maibabalik.
he: כל הניקודים והעיצובים יימחקו. לא ניתן לבטל.
hi: सभी स्कोर और थीम हटा दिए जाएंगे। यह पूर्ववत नहीं किया जा सकता।
ms: Semua skor dan tema akan dipadamkan. Tidak boleh dibatalkan.
sw: Hii itafuta alama zako zote na mandhari zilizofunguliwa. Haiwezi kutenduliwa.
th: คะแนนและธีมจะถูกลบทั้งหมด ไม่สามารถย้อนกลับได้
vi: Hành động này sẽ xóa toàn bộ điểm cao và giao diện đã mở khóa. Không thể hoàn tác.

source: Cancel
ar: إلغاء
bn: বাতিল
fa: لغو
fil: Kanselahin
he: ביטול
hi: रद्द करें
ms: Batal
sw: Ghairi
th: ยกเลิก
vi: Hủy

source: Delete
ar: حذف
bn: মুছুন
fa: حذف
fil: Burahin
he: מחק
hi: हटाएं
ms: Padam
sw: Futa
th: ลบ
vi: Xóa

source: Save
ar: حفظ
bn: সংরক্ষণ
fa: ذخیره
fil: I-save
he: שמור
hi: सहेजें
ms: Simpan
sw: Hifadhi
th: บันทึก
vi: Lưu

# changeName
source: Change Display Name
ar: تغيير الاسم
bn: নাম পরিবর্তন
fa: تغییر نام
fil: Palitan ang Pangalan
he: שנה שם
hi: नाम बदलें
ms: Tukar nama
sw: Badilisha jina
th: เปลี่ยนชื่อ
vi: Đổi tên hiển thị

# enterName
source: Enter your name
ar: أدخل اسمك
bn: আপনার নাম লিখুন
fa: نام خود را وارد کنید
fil: Ilagay ang pangalan mo
he: הזן את שמך
hi: अपना नाम दर्ज करें
ms: Masukkan nama anda
sw: Ingiza jina lako
th: ป้อนชื่อของคุณ
vi: Nhập tên của bạn

source: Leaderboard
ar: لوحة المتصدرين
bn: লিডারবোর্ড
fa: جدول رتبه‌بندی
he: טבלת מובילים
hi: लीडरबोर्ड
ms: Papan pendahulu
sw: Ubao wa viongozi
th: กระดานผู้นำ
vi: Bảng xếp hạng

source: Loading...
ar: جاري التحميل...
bn: লোড হচ্ছে...
fa: در حال بارگذاری...
fil: Naglo-load...
he: טוען...
hi: लोड हो रहा है...
ms: Memuatkan...
sw: Inapakia...
th: กำลังโหลด...
vi: Đang tải...

source: Error
ar: خطأ
bn: ত্রুটি
fa: خطا
he: שגיאה
hi: त्रुटि
ms: Ralat
sw: Hitilafu
th: ข้อผิดพลาด
vi: Lỗi

# emptyLeaderboard
source: No scores yet!
ar: لا توجد نتائج بعد!
bn: এখনো কোনো স্কোর নেই!
fa: هنوز امتیازی نیست!
fil: Wala pang scores!
he: אין ניקודים עדיין!
hi: अभी कोई स्कोर नहीं!
ms: Tiada skor lagi!
sw: Hakuna alama bado!
th: ยังไม่มีคะแนน!
vi: Chưa có điểm nào!

# tutorialTitle
source: How to Play
ar: طريقة اللعب
bn: কিভাবে খেলবেন
fa: نحوه بازی
fil: Paano Maglaro
he: איך לשחק
hi: कैसे खेलें
ms: Cara bermain
sw: Jinsi ya kucheza
th: วิธีเล่น
vi: Cách chơi

# tutorialStep1
source: Drag blocks to the grid
ar: اسحب الكتل إلى الشبكة
bn: ব্লক টেনে গ্রিডে আনুন
fa: بلوک‌ها را به شبکه بکشید
fil: I-drag ang blocks sa grid
he: גרור בלוקים לרשת
hi: ब्लॉक को ग्रिड पर खींचें
ms: Seret blok ke grid
sw: Buruta vitalu kwenye gridi
th: ลากบล็อกไปยังตาราง
vi: Kéo các khối gạch vào lưới

# tutorialStep2
source: Fill rows or columns to clear
ar: املأ الصفوف أو الأعمدة لمسحها
bn: সারি বা কলাম পূরণ করুন
fa: ردیف یا ستون را پر کنید
fil: Punuin ang row o column para i-clear
he: מלא שורות או עמודות
hi: पंक्तियाँ या स्तंभ भरें
ms: Isi baris atau lajur untuk menghapuskan
sw: Jaza safu mlalo au wima kufuta
th: เติมแถวหรือคอลัมน์เพื่อเคลียร์
vi: Lấp đầy hàng ngang hoặc dọc để ghi điểm

# tutorialStep3
source: Use hammers to break blocks
ar: استخدم المطرقة لتحطيم الكتل
bn: হাতুড়ি দিয়ে ভাঙুন
fa: از چکش برای شکستن استفاده کنید
fil: Gamitin ang martilyo para sirain ang blocks
he: השתמש בפטיש לשבירה
hi: हथौड़े से तोड़ें
ms: Guna tukul untuk memecahkan
sw: Tumia nyundo kuvunja
th: ใช้ค้อนทุบบล็อก
vi: Dùng búa để phá hủy một vùng 3x3 khi bí

# tutorialStep4
source: Don't run out of space!
ar: لا تنفد المساحة!
bn: জায়গা ফুরিয়ে যাবে না!
fa: فضایتان تمام نشود!
fil: Huwag maubusan ng espasyo!
he: אל תיגמר לך מקום!
hi: जगह खत्म न होने दें!
ms: Jangan kehabisan ruang!
sw: Usikose nafasi!
th: อย่าให้หมดพื้นที่!
vi: Trò chơi kết thúc khi không còn chỗ trống

source: Clear!
ar: رائع!
bn: চমৎকার!
fa: عالی!
he: מעולה!
hi: बढ़िया!
ms: Hebat!
sw: Poa!
th: เยี่ยม!
vi: Tuyệt vời!

source: Double Clear!
ar: مزدوج!
bn: ডাবল!
fa: دوتایی!
he: כפול!
hi: डबल!
ms: Berganda!
sw: Mbili!
th: ดับเบิ้ล!
vi: Quá Đỉnh!

source: TRIPLE CLEAR!
ar: ثلاثي!
bn: ট্রিপল!
fa: سه‌تایی!
he: משולש!
hi: ट्रिपल!
ms: TIGA KALI!
sw: TATU!
th: ทริปเปิ้ล!
vi: XUẤT SẮC!

# megaClear
source: MEGA CLEAR! x{count}
ar: ميغا! x{count}
bn: মেগা! x{count}
fa: مگا! x{count}
he: מגה! x{count}
hi: मेगा! x{count}
ms: MEGA! x{count}
sw: MEGA! x{count}
th: เมก้า! x{count}
vi: HUYỀN THOẠI! x{count}

source: Memory Reveal!
vi: Lộ diện!

source: Zen Clear!
vi: Tĩnh tâm!

# autoHammer
source: Auto Hammer! ({count} cells)
fil: 🔨 Auto Martilyo! ({count} cells)
vi: Búa Tự Động! ({count} ô)

source: Rising Row!
fil: ⬆️ Pumapaitaas na Row!
vi: Hàng đang dâng!

source: Auto Drop!
vi: Tự động thả!

source: End Session
ar: إنهاء
bn: শেষ করুন
fa: پایان
fil: Tapusin
he: סיום
hi: समाप्त
ms: Tamat
sw: Maliza
th: จบเซสชัน
vi: Kết thúc

source: FINDING RIVAL...
ar: البحث عن منافس...
bn: প্রতিদ্বন্দ্বী খুঁজছে...
fa: در حال یافتن حریف...
fil: NAGHAHANAP NG KALABAN...
he: מחפש יריב...
hi: प्रतिद्वंद्वी खोज रहे...
ms: MENCARI PESAING...
sw: KUTAFUTA MPINZANI...
th: กำลังหาคู่แข่ง...
vi: TÌM ĐỐI THỦ...

# matchmakingError
source: Matchmaking error: {error}
ar: خطأ في المطابقة: {error}
bn: ম্যাচমেকিং ত্রুটি: {error}
fa: خطای جورسازی: {error}
fil: Error sa paghahanap: {error}
he: שגיאת התאמה: {error}
hi: मैचमेकिंग त्रुटि: {error}
ms: Ralat padanan: {error}
sw: Kosa la mechi: {error}
th: ข้อผิดพลาดจับคู่: {error}
vi: Lỗi tìm trận: {error}

# zenSummaryTitle
source: ZEN SESSION ENDED
fil: Zen Session
vi: PHIÊN THIỀN KẾT THÚC

# totalLines
source: Lines Cleared
ar: خطوط ممسوحة
bn: মুছে ফেলা লাইন
fa: خطوط پاک‌شده
fil: Na-clear na Lines
he: שורות שנמחקו
hi: साफ़ की गई लाइनें
ms: Baris dipadam
sw: Mistari iliyofutwa
th: เส้นที่เคลียร์
vi: Hàng xóa

source: Max Combo
ar: أقصى كومبو
bn: সর্বোচ্চ কম্বো
fa: حداکثر کمبو
he: קומבו מקסימלי
hi: अधिकतम कॉम्बो
ms: Kombo maks
sw: Kombo ya juu
th: คอมโบสูงสุด
vi: Combo max

source: Blocks Placed
ar: كتل موضوعة
bn: স্থাপিত ব্লক
fa: بلوک‌های قرارداده‌شده
fil: Blocks na Nilagay
he: בלוקים שהונחו
hi: रखे गए ब्लॉक
ms: Blok diletakkan
sw: Vitalu vilivyowekwa
th: บล็อกที่วาง
vi: Khối đặt

source: Play Time
ar: وقت اللعب
bn: খেলার সময়
fa: زمان بازی
fil: Oras ng Laro
he: זמן משחק
hi: खेल का समय
ms: Masa bermain
sw: Muda wa mchezo
th: เวลาเล่น
vi: Thời gian thiền

# continueBtn
source: Continue
vi: Tiếp tục

source: Back to Lobby
vi: Về Lobby

# easyMode
source: Easy
ar: سهل
bn: সহজ
fa: آسان
fil: Madali
he: קל
hi: आसान
ms: Mudah
sw: Rahisi
th: ง่าย
vi: Dễ

# memoryMode
source: Memory
ar: ذاكرة
bn: স্মৃতি
fa: حافظه
he: זיכרון
hi: मेमोरी
ms: Memori
sw: Kumbukumbu
th: ความจำ
vi: Trí Nhớ

# classicMode
source: Classic
ar: كلاسيكي
bn: ক্লাসিক
fa: کلاسیک
he: קלאסי
hi: क्लासिक
ms: Klasik
sw: Kawaida
th: คลาสสิก
vi: Cổ Điển

# masterMode
source: Master
ar: خبير
bn: মাস্টার
fa: استاد
he: מאסטר
hi: मास्टर
sw: Bingwa
th: มาสเตอร์
vi: Bậc Thầy

# zenMode
source: Zen
ar: زِن
bn: জেন
fa: ذن
he: זן
hi: ज़ेन
th: เซน
vi: Thư Giãn

# survivalMode
source: Survival
ar: بقاء
bn: সারভাইভাল
fa: بقا
he: הישרדות
hi: सर्वाइवल
ms: Bertahan
sw: Kuishi
th: เอาชีวิตรอด
vi: Sinh Tồn

# pvpMode
source: PvP Battle
ar: معركة PvP
bn: PvP যুদ্ধ
fa: مبارزه PvP
fil: PvP Laban
he: קרב PvP
hi: PvP लड़ाई
ms: Pertempuran PvP
sw: Vita vya PvP
th: PvP ต่อสู้
vi: Đấu PvP

# practiceMode
source: Do Practice
ar: تدريب
bn: অনুশীলন
fa: تمرین
fil: Pagsasanay
he: אימון
hi: अभ्यास
ms: Latihan
sw: Mazoezi
th: ฝึกซ้อม
vi: Luyện Tập

source: Skip
ar: تخطي
bn: স্কিপ
fa: رد شدن
fil: Laktawan
he: דלג
hi: छोड़ें
ms: Langkau
sw: Ruka
th: ข้าม
vi: Bỏ qua

source: Next
ar: التالي
bn: পরবর্তী
fa: بعدی
fil: Susunod
he: הבא
hi: अगला
ms: Seterusnya
sw: Ifuatayo
th: ถัดไป
vi: Tiếp

source: START!
ar: ابدأ!
bn: শুরু!
fa: شروع!
fil: SIMULA!
he: התחל!
hi: शुरू!
ms: MULA!
sw: ANZA!
th: เริ่ม!
vi: BẮT ĐẦU!

source: Stats
ar: الإحصائيات
bn: পরিসংখ্যান
fa: آمار
he: סטטיסטיקות
hi: आँकड़े
ms: Statistik
sw: Takwimu
th: สถิติ
vi: Thống kê

source: Achievements
ar: الإنجازات
bn: অর্জন
fa: دستاوردها
he: הישגים
hi: उपलब्धियाँ
ms: Pencapaian
sw: Mafanikio
th: ความสำเร็จ
vi: Thành tích

source: Music
ar: الموسيقى
bn: সঙ্গীত
fa: موسیقی
he: מוזיקה
hi: संगीत
ms: Muzik
sw: Muziki
th: เพลง
vi: Nhạc nền

source: Themes
ar: السمات
bn: থিম
fa: تم‌ها
he: עיצובים
hi: थीम
ms: Tema
sw: Mandhari
th: ธีม
vi: Giao diện

source: Language
ar: اللغة
bn: ভাষা
fa: زبان
he: שפה
hi: भाषा
ms: Bahasa
sw: Lugha
th: ภาษา
vi: Ngôn ngữ

source: Choose Language
ar: اختر اللغة
bn: ভাষা নির্বাচন
fa: انتخاب زبان
he: בחר שפה
hi: भाषा चुनें
ms: Pilih bahasa
sw: Chagua lugha
th: เลือกภาษา
vi: Chọn ngôn ngữ

source: Auto (Device)
ar: تلقائي (الجهاز)
bn: স্বয়ংক্রিয় (ডিভাইস)
fa: خودکار (دستگاه)
he: אוטומטי (מכשיר)
hi: ऑटो (डिवाइस)
ms: Auto (Peranti)
sw: Kiotomatiki (Kifaa)
th: อัตโนมัติ (อุปกรณ์)
vi: Tự động (Thiết bị)

source: Data
ar: البيانات
bn: ডাটা
fa: داده‌ها
he: נתונים
hi: डेटा
th: ข้อมูล
vi: Dữ liệu

# best
source: Best: {score}
ar: الأفضل: {score}
bn: সেরা: {score}
fa: بهترین: {score}
he: שיא: {score}
hi: सर्वश्रेष्ठ: {score}
ms: Terbaik: {score}
sw: Bora: {score}
th: ดีที่สุด: {score}
vi: Cao nhất: {score}

# easyDesc
source: Small grid, many small blocks
ar: شبكة صغيرة، كتل صغيرة
bn: ছোট গ্রিড, ছোট ব্লক
fa: شبکه کوچک، بلوک‌های کوچک
he: רשת קטנה, בלוקים קטנים
hi: छोटी ग्रिड, छोटे ब्लॉक
ms: Grid kecil, banyak blok kecil
sw: Gridi ndogo, vitalu vidogo
th: ตารางเล็ก บล็อกเล็กเยอะ
vi: Lưới nhỏ, khối nhỏ nhiều

# classicDesc
source: Rising rows, clear fast!
ar: صفوف صاعدة، امسح بسرعة!
bn: সারি উঠছে, দ্রুত মুছুন!
fa: ردیف‌ها بالا می‌آیند، سریع پاک کن!
he: שורות עולות, מחק מהר!
hi: पंक्तियाँ उठती हैं, जल्दी साफ़ करो!
ms: Baris meningkat, padam cepat!
sw: Safu zinapanda, futa haraka!
th: แถวขึ้น เคลียร์เร็ว!
vi: Hàng dâng lên, phá nhanh!

# masterDesc
source: Auto-drop blocks, speed!
ar: سقوط تلقائي، سرعة!
bn: অটো-ড্রপ, গতি!
fa: سقوط خودکار، سرعت!
he: נפילה אוטומטית, מהירות!
hi: ऑटो-ड्रॉप, गति!
ms: Jatuh automatik, laju!
sw: Kushuka kiotomatiki, kasi!
th: ตกอัตโนมัติ ความเร็ว!
vi: Khối tự đặt, tốc độ!

# memoryDesc
source: Blocks vanish, remember positions
ar: الكتل تختفي، تذكر المواقع
bn: ব্লক অদৃশ্য, অবস্থান মনে রাখুন
fa: بلوک‌ها ناپدید می‌شوند، موقعیت‌ها را به خاطر بسپار
he: בלוקים נעלמים, זכור מיקומים
hi: ब्लॉक गायब, स्थिति याद रखें
ms: Blok hilang, ingat kedudukan
sw: Vitalu vinatoweka, kumbuka nafasi
th: บล็อกหายไป จำตำแหน่ง
vi: Khối biến mất, nhớ vị trí

# zenDesc
source: Relax, no lose
ar: استرخِ، بدون خسارة
bn: আরাম, হারানো নেই
fa: آرامش، بدون باخت
he: הרגע, בלי להפסיד
hi: आराम, हारने का डर नहीं
ms: Santai, tiada kekalahan
sw: Pumzika, hakuna kushindwa
th: ผ่อนคลาย ไม่แพ้
vi: Thư giãn, không thua

# pvpDesc
source: 1v1 battle in 2 minutes
ar: مبارزة 1v1 في دقيقتين
bn: 2 মিনিটে 1v1 দ্বন্দ্বযুদ্ধ
fa: دوئل 1v1 در 2 دقیقه
he: דו-קרב 1v1 ב-2 דקות
hi: 2 मिनट में 1v1 मुकाबला
ms: Duel 1v1 dalam 2 minit
sw: Pambano la 1v1 kwa dakika 2
th: ต่อสู้ 1v1 ใน 2 นาที
vi: Đấu 1v1 trong 2 phút

# pvpRankedSubtitle
source: Random match with real players
ar: مباراة عشوائية مع لاعبين حقيقيين
bn: আসল খেলোয়াড়দের সাথে র‍্যান্ডম ম্যাচ
fa: مسابقه تصادفی با بازیکنان واقعی
he: משחק אקראי עם שחקנים אמיתיים
hi: वास्तविक खिलाड़ियों के साथ यादृच्छिक मैच
ms: Perlawanan rawak dengan pemain sebenar
sw: Mechi nasibu na wachezaji halisi
th: จับคู่แบบสุ่มกับผู้เล่นจริง
vi: Ghép ngẫu nhiên với người chơi thật

# pvpPracticeSubtitle
source: Play solo with BOT • Unranked
ar: العب ضد بوت • بدون تصنيف
bn: বটের বিরুদ্ধে একা খেলুন • র‍্যাংক নেই
fa: بازی تکی با ربات • بدون رتبه‌بندی
he: משחק יחיד נגד בוט • ללא דירוג
hi: BOT के खिलाफ अकेले खेलें • रैंक नहीं
ms: Main solo melawan BOT • Tanpa ranking
sw: Cheza mwenyewe na BOT • Bila kiwango
th: เล่นเดี่ยวกับ BOT • ไม่มีอันดับ
vi: Chơi solo với BOT • Không tính xếp hạng

# gridInfo
source: {size}×{size} Grid • 2 Minutes
ar: شبكة {size}×{size} • دقيقتان
bn: {size}×{size} গ্রিড • 2 মিনিট
fa: شبکه {size}×{size} • 2 دقیقه
he: רשת {size}×{size} • 2 דקות
hi: {size}×{size} ग्रिड • 2 मिनट
ms: Grid {size}×{size} • 2 minit
sw: Gridi {size}×{size} • Dakika 2
th: ตาราง {size}×{size} • 2 นาที
vi: Lưới {size}×{size} • 2 Phút

source: Daily Challenge
ar: تحدي يومي
bn: দৈনিক চ্যালেঞ্জ
fa: چالش روزانه
he: אתגר יומי
hi: दैनिक चुनौती
ms: Cabaran harian
sw: Changamoto ya kila siku
th: ท้าทายประจำวัน
vi: Thử thách mỗi ngày

# dailyChallengeSubtitle
source: New challenge every day!
ar: تحدٍ جديد كل يوم!
bn: প্রতিদিন নতুন চ্যালেঞ্জ!
fa: هر روز یک چالش جدید!
he: אתגר חדש כל יום!
hi: हर दिन नई चुनौती!
ms: Cabaran baru setiap hari!
sw: Changamoto mpya kila siku!
th: ท้าทายใหม่ทุกวัน!
vi: Thử thách mới mỗi ngày!

source: Streak
ar: سلسلة
bn: ধারাবাহিক
fa: دور
he: רצף
hi: लगातार
ms: Berturut-turut
sw: Mfululizo
th: ต่อเนื่อง
vi: Chuỗi

source: Completed
ar: مكتمل
bn: সম্পন্ন
fa: تکمیل‌شده
he: הושלם
hi: पूर्ण
ms: Siap
sw: Imekamilika
th: เสร็จสิ้น
vi: Đã hoàn thành

source: PLAY
ar: العب
bn: খেলুন
fa: بازی
he: שחק
hi: खेलें
ms: MAIN
sw: CHEZA
th: เล่น
vi: CHƠI

source: No connection
ar: لا يوجد اتصال
bn: সংযোগ নেই
fa: بدون اتصال
he: אין חיבור
hi: कोई कनेक्शन नहीं
ms: Tiada sambungan
sw: Hakuna muunganisho
th: ไม่มีการเชื่อมต่อ
vi: Không có kết nối

# tetEffects
source: Tết Effects
ar: تأثيرات رأس السنة
bn: নববর্ষ প্রভাব
fa: جلوه‌های سال نو
he: אפקטי שנה חדשה
hi: नए साल के प्रभाव
ms: Kesan Tahun Baru
sw: Athari za Mwaka Mpya
th: เอฟเฟกต์ปีใหม่
vi: Hiệu ứng Tết

source: Pause
ar: إيقاف مؤقت
bn: বিরতি
fa: توقف
he: השהה
hi: रोकें
ms: Jeda
sw: Simamisha
th: หยุดชั่วคราว
vi: Tạm dừng

source: RESUME
ar: استئناف
bn: চালিয়ে যান
fa: ادامه
he: המשך
hi: जारी रखें
ms: SAMBUNG
sw: ENDELEA
th: เล่นต่อ
vi: TIẾP TỤC

source: QUIT
ar: خروج
bn: প্রস্থান
fa: خروج
he: צא
hi: बाहर
ms: KELUAR
sw: ONDOKA
th: ออก
vi: THOÁT

source: PAUSED
ar: متوقف
bn: বিরতিতে
fa: متوقف
he: מושהה
hi: रुका हुआ
ms: DIJEDA
sw: IMESIMAMISHWA
th: หยุดชั่วคราว
vi: TẠM DỪNG

source: New Features
ar: ميزات جديدة
bn: নতুন বৈশিষ্ট্য
fa: ویژگی‌های جدید
he: תכונות חדשות
hi: नई सुविधाएँ
ms: Ciri baru
sw: Vipengele vipya
th: ฟีเจอร์ใหม่
vi: Tính năng mới

source: Privacy Policy
ar: سياسة الخصوصية
bn: গোপনীয়তা নীতি
fa: حریم خصوصی
he: מדיניות פרטיות
hi: गोपनीयता नीति
ms: Dasar privasi
sw: Sera ya faragha
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật

# pvpWin
source: YOU WIN!
vi: BẠN THẮNG!

# pvpLose
source: YOU LOSE
vi: BẠN THUA

# pvpDraw
source: DRAW
vi: HÒA

source: Uploading...
vi: Đang tải...

source: Upload to Leaderboard
vi: Gửi lên bảng xếp hạng

source: Score uploaded!
vi: Đã gửi điểm!

# uploadFailed
source: Upload failed. Check connection.
vi: Gửi thất bại. Kiểm tra kết nối.

# tutorialReset
source: Tutorial will show on next game
vi: Tutorial sẽ hiện lại lần chơi tiếp theo

# highScoresCleared
source: All high scores cleared
vi: Đã xóa tất cả điểm cao

# botBeginner
source: Beginner
vi: Tập Sự

# botPro
source: Professional
vi: Chuyên Nghiệp

# botDestroyer
source: Destroyer
vi: Hủy Diệt

# botGodlike
source: Godlike
vi: Siêu Thần

source: Version
vi: Phiên bản

# soundSubtitle
source: Game sound effects
vi: Hiệu ứng âm thanh

# hapticsSubtitle
source: Vibration feedback
vi: Phản hồi rung

# musicSubtitle
source: Background music
vi: Nhạc nền game

# tetSubtitle
source: Tết visual effects
ar: Tet visual effects
bn: Tet visual effects
fa: Tet visual effects
he: Tet visual effects
hi: Tet visual effects
ms: Tet visual effects
sw: Tet visual effects
th: Tet visual effects
vi: Hiệu ứng hình ảnh Tết

# tutorialSubtitle
source: Show tutorial again
vi: Hiện lại hướng dẫn

# resetSubtitle
source: Clear all high scores
vi: Xóa tất cả điểm cao

source: SHARE SCORE
vi: CHIA SẺ ĐIỂM

source: YOU
vi: BẠN

source: RIVAL
vi: ĐỐI THỦ

source: Solo PvP
ar: PvP فردي
bn: একক PvP
fa: PvP تکی
he: PvP יחיד
hi: सोलो PvP
sw: PvP Peke yako
th: โซโล PvP
